# # 算术运算符号：+ - * / // % **
# print("10 + 4 =" , 10 + 4) # 加
# print("10 - 4 =" , 10 - 4) # 减
# print("10 * 4 =" , 10 * 4) # 乘
# print("10 / 4 =" , 10 / 4) # 除
# print("10 // 4 =" , 10 // 4) # 整数（取整数为结果）
# print("10 % 4 =" , 10 % 4) # 取余/求根
# print("10 ** 4 =" , 10 ** 4) # 幂函数，10的4次方
#
#
#
# # 算术运算符的优先级 --> ** -->  *  /  //  %  -->  +  -
# print("0.1 + 10 / 4**2 =" , 0.1 + 10 / 4**2)

#
# # 案例：输入两个数 x 和 y， 计算 x + y 以及 x - y 的结果并输出
# # float(..) --> 将其他类型 转为 浮点类型
# x = float(input("x = "))
# y = float(input("y = "))
#
# # 0.9999999999999998 --> 精度损失：由于计算机底层是基于 二进制 进行数据的存储与处理，二进制是无法准确的表示所有的小数，因此涉及到浮点数的运算，可能会损失精度
# print("x + y",x + y)
# print("x - y",x - y)


# # 练习：案例1：计算输入的三个整数的平均数
# num1 = int(input("请输入第一个数字："))
# num2 = int(input("请输入第二个数字："))
# num3 = int(input("请输入第三个数字："))
#
#
# print("平均数为：",(num1 + num2 + num3) / 3)


# # 案例2：要求输入梯形的上底、下底、高，然后计算梯形的面积
# a1 = float(input("请输入梯形上底的长度："))
# a2 = float(input("请输入梯形下底的长度："))
# a3 = float(input("请输入梯形高的长度："))
#
# print("梯形面积为：", ((a1 + a2) * a3) / 2)


# # 案例3：要求输入圆的半径(r)，然后计算圆的周长(c)和面积(s) （周长：2πr，面积：πr²）
# #引入数学库
# import math
#
# #输入
# r = float(input("请输入圆的半径："))
#
# #输出
# print("圆的周长为：",2 * math.pi * r)
# print("圆的面积为：", math.pi * r ** 2)


# 案例4:身体质量指数BMI的计算（BMI=体重(kg）/身高(m)²）
# 1.输入体重(单位kg)
# 2.输入身高(单位m)
# 3.计算身体质量指数BMI并输出

# #输入
# weight = float(input("请输入体重："))
# hight = float(input("请输入身高："))
#
# #输出
# print("您的BMI指数为:", weight / hight ** 2)




# # 赋值运算符
# num = 85
#
# num += 10 # num + 10 = 95
# print("num += 10 后，num = ", num)
#
# num -= 10 # num - 10 = 85
# print("num -= 10 后，num = ", num)
#
# num *= 10 # num * 10 = 850
# print("num *= 10 后，num = ", num)
#
# num /= 10 # num / 10 = 8.5
# print("num /= 10 后，num = ", num)
#
# num //= 10 #num // 10 =
# print("num //= 10 后，num = ", num)
#
# num %= 3 # num % 10 = 8
# print("num %= 3 后，num = ", num)
#
# num **= 3 # num ** 10 =
# print("num **= 3 后，num = ", num)



# #比较运算符
# print("100 == 100 ：", 100 == 100) #True
# print("'100' == '100'",'100' == '100') #True
# print("100 != 100 ：", 100 != 100) #False
# print("100 <= 100 ：", 100 <= 100) #True
# print("100 >= 100 ：", 100 >= 100) #True
# print("100 > 100 ：", 100 > 100) #False
# print("100 < 100 ：", 100 < 100) #False



#逻辑运算符 （and , or , not ）
# 案例
#需求1：
# num = input("请输入一个整数：")
# n = int(num)
# print(f"{n}在10-20之间：", 10 <= n <= 20) # and连接的条件是并且的关系，两条件同时成立（True），否则，就是（False）
#print(f"{n}在10-20之间：", n >= 10 and n <= 20) #and连接的条件是并且的关系，两条件同时成立（True），否则，就是（False）

#需求2：键盘输入一个整数，判断这个数的范围是否不在10-20之间
# n = int(input("请输入一个整数："))
# print(f"{n}不在10-20之间",n < 10 or n > 20) # or连接的条件，是或者的关系，只要其中有一个成立（True），全都不成立，结果才是False



