"""
列表：是数据容器中的一类，是一次性可以储存多个数据（元素）。
定义：列表名称 = [元素1，元素2，元素3....]    s = [54.15.75.108.32.78.75]
特点：
    1.可以存储不同类型的元素
    2.元素有序，可以重复，元素可以修改

序列类型：容器中的元素按特定顺序排列的，可通过索引访问的容器类型称之为序列
注意：从前向后（正向索引），下标从0开始：
     从后往前（反向索引），下标从-1开始
"""

# #列表操作
# #定义 - list
# s = [56,90,88,65,90,"A","Hello",True]
#
# # 列表是什么类型
# print(type(s)) # list
#
# # 访问列表元素
# # 获取
#
# print(s[0]) # 正向索引，从0开始
# print(s[-8]) # 反向索引，从-1开始
#
# print(s[3])
# print(s[-6])
#
#
# # 修改
# s[5] ="ABC"
# print(s)
#
#
# #注意：如果所指定的索引，超出范围，将会报错 list assignment index out of range
# # s[10] = "DEF"
# # print(s)
#
#
# # 删除
# del s[6]
# print(s)
#
#
# # 遍历
# for item in s:
#     print(item)

"""
列表-切片
介绍：切片是指对操作的数据截取其中一部分的操作。列表，字符串，元素都支持切片操作。

语法：序列数据[开始索引:结束索引：步长]
    ·不包含结束索引位置对应的元素（开始索引未指定默认为0）：结束索引未指定默认为列表长度（直到列表末尾）；步长未指定默认为1
    ·索引采用正向，反向索引都可以
    ·步长是选取间隔，默认步长为1
"""

#---------------列表 list 切片-------------------------
# 定义列表
# s = ["A", "C", "H", "K", "L", "B", "X", "C", "U"]
#
# #切片操作 s
#
# print(s[0:5:1])
# print(s[:5:1])
# print(s[:5:])
# print(s[:5])
#
#
# print(s[0:-2:1])
# print(s[-2:1])



# ------------------列表 list 常用方法-------------------
# 列表定义
# s = [65,90,88,65,90,100,209,72,145]
# print(s)
#
# # append()：在列表尾部添加元素
# s.append(188)
# print(s)
#
#
# # insert()：在指定索引之前，输入元素
# s.insert(2,80)
# print(s)
#
#
# # remove()：移除列表中第一个匹配到的元素
# s.remove(90)
# print(s)
#
#
# # pop()：删除列表中指定索引位置的元素并返回（如未指定，默认删除最后一个）
# e = s.pop(1)
# print(e)
#
# e = s.pop()
# print(e)
#
# print(s)
#
#
# # sort()：排序
# s.sort()
# print(s)
#
#
# # reverse()：反转列表元素
# s.reverse()
# print(s)



# ------------------列表 list 案例-------------------
#案例1：请将用户输入的10个数字，存储到一个列表当中，并将列表中的数字进行排序，输出其中的最小值，最大值，和平均值

# 1.定义列表
# num_list = []
#
# # 2.将用户输入的10个数字存入列表
# for a in range(1,11):
#     num = int(input(f"请输入第{a}个数字："))
#     num_list.append(num)
#
# print(f"数字列表：",num_list)
#
#
# # 3.排序
# num_list.sort()
# print(f"排序后为：",num_list)
#
#
# #。输出最小值，最大值，品均值
# #最大值
# print("最大值为：",num_list[9])
#
# #最小值
# print("最小值为：",num_list[0])
#
# #平均值 ----> sum()求和 ; len() 获取元素个数（列表的长度）
# print("平均值为：",sum(num_list) / len(num_list))


# 案例2：合并两个列表中的元素，并对合并的结果进行去重处理（去除列表中的重复元素）
# num_list1 = [19,23,54,64,875,20,109,232,123,54]
# num_list2 = [55,80,72,35,60,123,54,29,91]
#
# # 合并列表
# # ----> 方法1
# num = []
# num = num_list1 + num_list2
#
#
# # ----> 方法2
# num1 = num_list1.copy()
# for a in num_list2:
#     num1.append(a)
#
# # ----> 方法3（简化）<解包>
# # 解包：将列表这一类容器拆开成一个个独立的元素
# # 组包：将多个值合并到一个容器
# num2 = [*num_list1, *num_list2]
#
#
# print(f"方法一（直接加）：",num)
# print(f"方法二（循环）：",num1)
# print(f"方法三（解包）：",num2)
#
#
# # 2.去重复记录
# new_list = []
# for b in num1:
#     if b not in new_list:
#         new_list.append(b)
#
# print("去重后列表为",new_list)
# new_list.sort()
# print("排序后列表为",new_list)



"""
1.生成1-20的平方列表
2.从如下数字列表中提取所有偶数，并计算其平方，组成一个新的列表。
num_list = [19,23,54,64,87,20,109,232,123,43,26,55,72]
"""
"""
# 1.生成1-20的平方列表
# 方式一：传统方式

num_list1 = []
for a in range(1,21):
    a **= 2
    num_list1.append(a)

print("1-20的平方列表为：",num_list1)

# 方式2：列表推导式 ----> 就是按照一定的规则快速生成一个列表的方法 --> 语法格式1：[要插入的值 for i in 序列/列表]
num_list3 = [i**2 for i in range(1,21)]
print("1-20的平方列表为：",num_list3)



# 2.从如下数字列表中提取所有偶数，并计算其平方，组成一个新的列表。
# 列表推导式 ----> 就是按照一定的规则快速生成一个列表的方法 --> 语法格式2：[要插入的值 for i in 序列/列表 if 条件]

num_list2 = []
num_list = [19,23,54,64,87,20,109,232,123,43,26,55,72]
for b in num_list:
    if b % 2 == 0:
        b **= 2
        num_list2.append(b)
print("列表中偶数平方列表为：",num_list2)

#简化
num_list4 = [c**2 for c in num_list if c % 2 == 0]
print("列表中偶数平方列表为：",num_list4)
"""



"""
# 练习
# 1.将如下多个列表合并为一个列表，并去除重复元素，排好序（升序）后退出到操控台。
list1 = ['M','A','C','E','F','G','H','L','N','I','J','K','O']
list2 = ['X','Z','T','Y','D','E','F','G',]
list3 = ['W','A','S','O']

# 合并
list_1 = [*list1, *list2, *list3]

#去重
list_2 = []
for a in list_1:
    if a not in list_2:
        list_2.append(a)

#排序
list_2.sort()
print("最终结果为",list_2)

"""

# # 2.将如下列表中能被3 或 5整除的元素提出来，并获取这些数字对应的平方，组成一个新的列表。
# list1 = [1,2,3,4,5,6,7,8,9,10,11,12,13,14,15,16,17,18,19,20,21,22,23,24,25,26,27,28,29,30]
# list_1 = [i**2 for i in list1 if i % 3 == 0 or i % 5 == 0]
# print(list_1)


# 3.将如下列表中的正数提取出来，封装为一个新的列表。
list1 = [11,2,31,4,-5,15,17,28,49,10,-11,16,54,-14,36,-16,87,-39]
list_1 = [i for i in list1 if i > 0 ]
print(list_1)


